// 名詞
var noun = [
  // 植物
  "植物","花","葉","木","ユリ","バラ","アイリス","ひまわり","桜","ナツメヤシ","オリーブ","クルミ",
  "果物","葡萄","林檎","蜜柑","柑橘系","ザクロ","ベリー",
  "野菜","トマト","ナス","きのこ",
  // 動物
  "動物","犬","猫","ねずみ","うさぎ","狼","羊","牛","猿","鳩","蛇",
  "鳥","鷲","孔雀",
  "魚","金魚",
  "虫","蝶","蜂",
  // 自然
  "虹","泉","雲","光","水","氷",
  // 架空
  "精霊","聖霊","魔女","一角獣","おばけ","龍","人魚",
  // 人物
  "男性","女性","赤子","子供","大人","老人","番人","王","女王","王子","姫","ピエロ","ヒーロー",
  // 臓器
  "体","頭","顔","耳","目","鼻","口","歯","血",
  "臓器","脳","心臓",
  "骨","頭蓋骨","肋骨","背骨",
  "羽","翼",
  // 時間・季節・天気
  "過去","現在","未来","時","春","夏","秋","冬","晴れ","曇り","雨","雪","雷",
  // 場所
  "家","階段","書斎","部屋","学校","廊下","教会","町","街","海","山","森","空","宇宙","道","裏路地","都市","図書館","庭園",
  // 物
  "天秤","本","絵画","楽器","弓矢","窓","時計","墓","人形","ぬいぐるみ","おもちゃ","首輪","トランプ","棺",
  // 食べ物・飲み物
  "パン","ワイン","お菓子","金平糖","飴",
  // 宗教
  "神","女神","天使","天国","地獄","理想郷","十字架",
  // セフィロト（他は「ads」にある）
  "王冠","王国",
  // タロット（他は「ads」にある）
  "愚者","魔術師","女教皇","女帝","皇帝","恋人","戦車","死刑囚","死神","悪魔","塔","星","月","太陽",
  // その他
  "法律","裁判",
]

// 抽象
var ads = [
  // セフィロト（足りないのは、「noun」にある）
  "知恵","理解","慈悲","峻厳","美","勝利","栄光","基礎","知識","無","無限","無限光",
  // クリフォト
  "無神論","愚鈍","拒絶","無感動","残酷","醜悪","色欲","貪欲","不安定","物質主義","無形","虚無","闇",
  // タロット（足りないのは、「noun」にある）
  "力","隠者","運命","正義","節制","審判","世界",
  // タロット・意味（被ったら先に書いたのを優先）
  // 愚者
  "自由","無邪気","純粋","発想","天才","夢想","愚行","極端","熱狂",
  // 魔術師
  "起源","機会","才能","感覚","創造","混迷","無気力","裏切り","消極","意志",
  // 女教皇
  "直感","感性","知性","聡明","悲観","無神経","孤立","秘密","神秘","英知",
  // 女帝
  "繁栄","豊穣","愛情","情熱","豊満","包容","謙虚","挫折","軽率","虚栄","怠惰","戯言","実り","行動","未知",
  // 皇帝
  "支配","安定","達成","権威","意思","責任","未熟","横暴","傲慢","身勝手","独断","無責任","統治","堅固さ","防御","同盟",
  // 教皇
  "協調","信頼","自信","遵守","人徳","束縛","不信","逃避","固着","信条","社会性",
  // 恋人
  "共感","選択","絆","継続","誘惑","不道徳","失恋","無視","空虚","破綻","魅力","愛",
  // 戦車
  "征服","援軍","成功","積極","開拓","精神","独立","解放","優勢","自己暗示","暴走","注意","失敗","好戦的","劣勢","無知","摂理","復讐",
  // 力
  "理性","自制","実行","卑下","寛大","名誉",
  // 隠者
  "経験","秘匿","慎重","難解","閉鎖","陰湿","誤解","邪推","劣等感","疎通","深慮","忠告","崩壊",
  // 運命
  "転換","幸運","変化","結果","出会い","解決","結束","別れ","到来","転機","向上",
  // 正義
  "公正","善行","均衡","誠意","善意","両立","慈善","不正","不公正","偏向","不均衡","被告","平等","正しさ","行政","判決",
  // 死刑囚
  "修行","忍耐","奉仕","努力","試練","着実","抑制","妥協","徒労","英知","慎重","直観",
  // 死神
  "停止","終末","破滅","離散","終局","清算","決着","終焉","消滅","全滅","上昇","再生","損失","死",
  // 節制
  "調和","自制","節度","献身","浪費","消耗","調節","中庸","倹約","管理",
  // 悪魔
  "拘束","堕落","悪循環","嗜虐","破天荒","憤怒","回復","覚醒","リセット","暴力","激烈",
  // 塔
  "破壊","崩壊","災害","悲劇","悲惨","惨事","惨劇","凄惨","喪失","妄想","洗脳","自傷","緊迫","不幸","無念","屈辱","悲嘆","災難","不名誉","転落",
  // 星
  "希望","願い","失望","絶望","瞑想","霊感","放棄",
  // 月
  "幻惑","危険","欺瞞","幻滅","過去",
  // 太陽
  "誕生","祝福","約束","将来","不調","落胆","衰退",
  // 審判
  "復活","改善","発展","悔恨","更新",
  // 世界
  "完成","完全","完璧","永遠","正確","低迷","未完成","旅","宇宙",
  // その他
  "罪","罰","異端","無垢","犠牲","生贄","構造","感情","原因","思考","触覚","視覚","聴覚","味覚","嗅覚",
  "時間","空間","秩序","現在","未来","優越","魔術","魔法","忠誠","誠実","友情","潔白","忍耐","邪悪","賢明",
  "生命","命","魂","知識","純潔","平和","洗礼","権利","本能","衝動","殉教","成長","最初","最後","音楽",
  "嘘","真実","芸術","晩餐","宿命","悪徳","美徳","神秘","独裁"," 距離","信念","記憶","哀悼","忠実",
]

// 感情
var emo = [
  // 基本感情（純粋感情）/一次感情
  "平穏","喜び","恍惚",
  "容認","信頼","敬愛",
  "不安","恐れ","恐怖",
  "放心","驚き","驚嘆",
  "哀愁","悲しみ","悲観",
  "うんざり","嫌悪","強い嫌悪",
  "苛立ち","怒り","激怒",
  "興味","期待","警戒",
  // 混合感情/二次感情
  "愛","服従","畏怖","拒絶","後悔","軽蔑","攻撃","楽観",
  "罪悪感","好奇心","絶望","憤慨","悲憤","皮肉","自尊心","希望",
  "感動","感傷","恥辱","憎悪","悲観","不健全（病的状態）","優越",
  // その他
  "安心","感謝","興奮","冷静","焦燥","不思議","幸せ","緊張","尊敬","憧憬",
  "欲望","勇気","快感","満足","不満","殺意","無念","劣等感","空虚","怨み",
  "同情","困惑","寂しい","嘆き","憂鬱","喪失感","躊躇","心配","戦慄","嫉妬",
  "動揺","辛い","切ない","我慢","悩む","呆れ","哀れ","屈辱","諦め","愉快",
  "不愉快","不機嫌","落胆","諦念",
]

// 柄・模様
var patt = [
  // 日本/縞（しま）
  "棒縞（ぼうじま）","子持縞（こもちじま）","両子持縞（りょうこもちじま）","滝縞（たきじま）","両滝縞（りょうたきじま）","鰹縞（かつおじま）","金通縞（きんつうじま）","三筋立（みすじだて）","大名縞（だいみょうじま）","千筋（せんすじ）","万筋（まんすじ）","刷毛目（はけめ）","矢鱈縞（やたらじま）","よろけ縞（よろけじま）","だんだら縞（だんだらじま）",
  "芝翫縞（しかんじま）",
  // 日本/格子（こうし）
  "格子縞（こうしじま）","升格子(ますこうし)","碁盤格子（ごばんごうし）","弁慶縞（べんけいじま）","童子格子（どうじごうし）","微塵格子（みじんごうし）","二筋格子（ふたすじごうし）","三筋格子（みすじごうし）","四筋格子（よすじごうし）","味噌漉格子（みそこしごうし）","千鳥格子（ちどりごうし）","千本格子（せんぼんごうし）","菊格子（きくこうし）","翁格子（おきなごうし）","業平格子（なりひらこうし）",
  "網代格子（あじろこうし）","微塵格子（みじんごうし）",
  // 日本/多角形
  // 三角形
  "鱗（うろこ）","三つ組手（みつくで）","山路文（やまじもん）",
  // 四角形
  "市松模様（いちまつもよう）","算木崩し（さんぎくずし）","角繋ぎ（かくつなぎ）","檜垣（ひがき）","釘抜（くぎぬき）",
  // 四角形「菱形（ひしがた）」
  "菱（ひし）","花菱（はなびし）","菱菊（ひしぎく）","入子菱（いりこびし）","業平菱（なりひらびし）","三重菱（さんじゅうひし）","井筒割菱（いつつわりびし）","割菱つなぎ（わりびしつなぎ）","襷（たすき）","三重襷（みえだすき）","算盤絞り（そろばんしぼり）","松皮菱（まつかわびし）","小波文（さざなみもん）","武田菱（たけだびし）",
  // 六角形
  "麻の葉（あさのは）","角麻（かくあさ）","六つ手卍（むつでのまんじ）","籠目（かごめ）","籠目・網（かごめ・あみ）","亀甲（きっこう）","亀甲繋ぎ（きっこうつなぎ）","毘沙門亀甲（びしゃもんきっこう）","組亀甲（くみきっこう）","亀甲花菱（きっこうはなびし）","積石亀甲（つみいしきっこう）",
  // 八角形
  "蜀江（しょっこう）",
  // 日本/丸・円・曲線
  // 丸・円
  "七宝（しっぽう）","花七宝（はなしっぽう）","七宝花菱（しっぽうはなびし）","七宝繋ぎ（しっぽうつなぎ）","星七宝（ほししっぽう）","青海波（せいがいは）","魚鱗（ぎょりん）","巴（ともえ）","一つ巴（ひとつどもえ）","二つ巴（ふたつどもえ）","三つ巴（みつどもえ）",
  // 曲線
  "観世水（かんぜみず）","立涌（たちわき）","網目（あみめ）","分銅繋ぎ（ふんどうつなぎ）","徳利網代（とっくりあじろ）","露芝（つゆしば）","ヱ霞（えがすみ）",
  // 日本/植物・花・葉
  "氷梅（こおりうめ）","槍梅（やりうめ）","小桜（こざくら）","桜（さくら）","桜散らし（さくらちらし）","松葉散らし（まつばちらし）","桜楓（おうふう）","花勝見（はなかつみ）","橘（たちばな）","一つ茶の実（ひとつちゃのみ）","遠州椿（えんしゅうつばき）","菖蒲革（しょうぶがわ）","立涌花菱（たちわきはなびし）","胡麻（ごま）","かさね竜胆（かさねりんどう）",
  // 日本/動物・鳥
  "脹雀・福良雀（ふくらすずめ）","雁金（かりがね）","後ろ向き三つ兎（うしろむきみつうさぎ）","尻合せ三つ兎（しりあわせみつうさぎ）","真向き兎（まむきうさぎ）","有栖川錦（ありすがわにしき）",
  // 日本/小紋
  "鮫小紋（さめこもん）","行儀小紋（ぎょうぎこもん）","角通し（かくとおし）","霰小紋（あられこもん）",
  // 日本/絣・飛白・かすり
  "矢絣（やがすり）","十字絣（じゅうじがすり）","蚊絣（かがすり）","井桁絣（いげたがすり）",
  // 日本/役者文様
  "高麗格子（こうらいごうし）","三枡格子（みますごうし）","三枡繋ぎ（みますつなぎ）","六弥太格子（ろくやたごうし）","三津五郎縞（みつごろうじま）","菊五郎格子（きくごろうごうし）","市村格子（いちむらごうし）","芝翫縞（しかんじま）","亀蔵小紋（かめぞうこもん）","手綱染（たづなぞめ）","イ菱（いびし）","鎌輪ぬ（かまわぬ）","斧琴菊（よきこときく）",
  // 日本/光琳模様
  "光琳梅（こうりんうめ）","光琳梅鉢（こうりんうめばち）","光琳松（こうりんまつ）","光琳一つ根松（こうりんひとつねまつ）","光琳桔梗（こうりんききょう）","光琳爪形桔梗（こうりんつめがたききょう）","光琳菊（こうりんぎく）","光琳桐（こうりんきり）","光琳片喰（こうりんかたばみ）","光琳鉄線（こうりんてっせん）",
  "中陰光琳蔦（ちゅうかげこうりんづた）","太陰光琳蔦（ふとかげこうりんづた）","光琳二つ茶の実（こうりんふたつちゃのみ）","光琳鶴の丸（こうりんつるのまる）","六角光琳鶴（ろっかくこうりんつる）","光琳亀（こうりんかめ）","光琳揚羽蝶（こうりんあげはちょう)","光琳胡蝶（こうりんこちょう）","千鳥（ちどり）","光琳洲浜（こうりんすはま）",
  // 日本/雪文様
  "雪華文（せっかもん）","雪（ゆき）","吹雪（ふぶき）","初雪（はつゆき）","春の雪（はるのゆき）","矢雪（やゆき）","氷柱雪（つららゆき）","山吹雪（やまふぶき）","春風雪（はるかぜゆき）","雪輪（ゆきわ）",
  // 日本/その他
  "釘抜繋ぎ（くぎぬきつなぎ）","曲輪繋ぎ（くるわつなぎ）","吉原繋ぎ（よしわらつなぎ）","子持吉原（こもちよしわら）","毛卍文（けまんもん）","唐草模様（からくさもよう）","豆絞り（まめしぼり）","鹿の子（かのこ）","紗綾形（さやがた）","紗綾形崩し（さやがたくずし）","工字繋ぎ（こうじつなぎ）","一の字繋ぎ（いちのじつなぎ）","井桁卍（いげたまんじ）","雷紋（らいもん）","一つ豆蔵（ひとつまめぞう）",
  "摺疋田（すりびった）","切り金（きりがね）","御召十（おめしじゅう）","井桁(いげた)","釘抜繋ぎ（くぎぬきつなぎ）","絞り染め（しぼりぞめ）",

  // 植物・花
  // チェック
  "チェック","斜めチェック","ガンクラブチェック","グレンチェック","シェパードチェック","メガチェック","ウィンドウペン","グラフチェック","アーガイルチェック","グラデーションチェック","ギンガムチェック","タータンチェック","エプロンチェック","ブロックチェック","オーバーチェック","ハーリキンチェック",
  "タッタソールチェック","ハウスチェック","マドラスチェック","バッファローチェック","バイアスチェック","オンブレチェック","トーンオントーンチェック","キャバリーツイル","シャドーチェック","ダイヤモンドチェック","タータン","ツーアンドツーチェック","ドスキン","バスケットチェック",
  // 水玉（ドット）
  "ドット","ピンドット","バーズアイ","コインドット","リングドット","ポルカドット","シャワードット","バブルドット","ランダムドット","ピンヘッド",
  // ストライプ
  "ピンヘッドストライプ","ピンストライプ","ロンドンストライプ","ベンガルストライプ","トリプルストライプ","ダブルストライプ","ペンシルストライプ","ヘアラインストライプ","キャンディストライプ","レジメンタルストライプ","レップストライプ","シックシンストライプ","オルタネイトストライプ","セルフストライプ","シャドーストライプ",
  "カスケードストライプ","オンブレストライプ","チョークストライプ","ダイアゴナルストライプ","ヒッコリー","ヘリンボーン","ボーダー","マルチボーダー","オーニングストライプ","レガッタストライプ","シェブロンストライプ","クラブストライプ","リボンストライプ","スラスターストライプ","モアレ",
  "レイズドストライプ","ケーブルストライプ","シャドーストライプ","ケーブルストライプ","ブロックストライプ","ヘアーライン",
  // 柄
  "ロココ調","ボタニカル柄","トロピカル柄","トライバル柄","ボヘミアン","マラケシュ","チマヨ","ドリッピング","コスミック柄","リザード","マーブル柄","ダマスク柄","オプティカル柄","モノグラム","アラベスク",
  "オーナメント柄","ペイズリー柄","迷彩柄","デザートカモ","アニマル柄","ピーコック柄","ゴブラン","フェアアイル","ジャカード","ノルディック柄","ルースコスタ","スカンジナビアン柄","イカット","イリデッセンス","オートミール",
  "サンクロス","ホップサック","ヘリングボーン",
  // レース
  "チュールレース","バテンレース","アイレットレース","クロッシェレース","マクラメレース",
  // マーク
  "ハート","星","クロス","スカル",
]

// 色
var color = [
  // 日本・赤
  "赤（あか）","金赤（きんあか）","紅赤（べにあか）","紅色（べにいろ）","一斤染（いっこんぞめ）","薄紅（うすくれない）","喑紅色（あんこうしょく）","退紅色（たいこうしょく)","今様色（いまよういろ）","韓紅色（からくれないいろ）",
  "真紅（しんく）","朱色（しゅいろ）","潤朱（うるみしゅ）","洗朱（あらいしゅ）","丹色（にいろ）","真赭（真赭）","鉛丹色（えんたんいろ）","黄丹（おうに）","臙脂（えんじ）","東雲色（しののめいろ）",
  "茜色（あかねいろ）","緋色（ひいろ）","浅緋（あさひ）","深緋（ふかひ）","紅緋（べにひ）","猩々緋（しょうじょうひ）","蘇芳（すおう）","桜色（さくらいろ）","灰桜（はいざくら）","紅梅色（こうばいいろ）",
  "梅鼠（うめねず）","桃色（ももいろ）","薔薇色（ばらいろ）","撫子色（なでしこいろ）","牡丹色（ぼたんいろ）","苺色（いちごいろ）","鴇色（ときいろ）","珊瑚色（さんごいろ）","躑躅色（つつじいろ）",
  // 日本・黄
  "鶯茶（うぐいすちゃ）","鶸茶（ひわちゃ）","黄色（きいろ）","中黄（ちゅうき）","黄赤（きあか）","刈安色（かりやすいろ）","黄蘗色（きはだいろ）","梔子色（くちなしいろ）","鬱金色（うこんいろ）","肌色（はだいろ）",
  "雄黄（ゆうおう）","雌黄（しおう）","蜜柑色（みかんいろ）","柑子色（こうじいろ）","橙色（だいだいいろ）","赤橙（あかだいだい）","柿色（かきいろ）","洗柿（あらいがき）","杏色（あんずいろ）","人参色（にんじんいろ）",
  "菜の花色（なのはないろ）","山吹色（やまぶきいろ）","萱草色（かんぞういろ）","蒲公英色（たんぽぽいろ）","向日葵色（ひまわりいろ）","油色（あぶらいろ）","卵色（たまごいろ）","芥子色（からしいろ）",
  // 日本・緑
  "萌葱色（もえぎいろ）","緑（みどり）","浅緑（あさみどり）","深緑（ふかみどり）","若緑（わかみどり）","薄緑（うすみどり）","暗緑色（あんりょくしょく）","灰緑（はいみどり）","黄緑（きみどり）","青緑（あおみどり）",
  "草色（くさいろ）","若草色（わかくさいろ）","千草色（ちぐさいろ）","萌黄（もえぎ）","若葉色（わかばいろ）","苗色（なえいろ）","若苗色（わかなえいろ）","麹塵（きくじん）","青竹色（あおたけいろ）","若竹色（わかたけいろ）",
  "老竹色（おいたけいろ）","柳色（やなぎいろ）","裏葉柳（うらばやなぎ）","木賊色（とくさいろ）","苔色（こけいろ）","海松色（みるいろ）","常磐色（ときわいろ）","千歳緑（ちとせみどり）","松葉色（まつばいろ）","青磁色（せいじいろ）",
  "抹茶色（まっちゃいろ）","山葵色（わさびいろ）","緑青色（ろくしょういろ）","白緑（びゃくろく）","青丹（あおに）","鶯色（うぐいすいろ）","鶸色（ひわいろ）",
  // 日本・青
  "青（あお）","空色（そらいろ）","水色（みずいろ）","瑠璃色（るりいろ）","瑠璃紺（るりこん）","群青色（ぐんじょういろ）","白群（びゃくぐん）","紺青（こんじょう）","藍色（あいいろ）","濃藍（こいあい）",
  "瓶覗き（かめのぞき）","勝色（かちいろ）","縹色（はなだいろ）","紺色（こんいろ）","濃紺（のうこん）","鉄紺（てつこん）","紺藍（こんあい）","納戸色（なんどいろ）","鉄納戸（てつなんど）","納戸茶（なんどちゃ）",
  "錆納戸（さびなんど）","藤納戸（ふじなんど）","鉄色（てついろ）","浅葱色（あさぎいろ）","水浅葱（みずあさぎ）","錆浅葱（さびあさぎ）","新橋色（しんばしいろ）","露草色（つゆくさいろ）","勿忘草色（わすれなぐさいろ）","秘色（ひそく）",
  // 日本・紫
  "紫（むらさき）","濃色（こきいろ）","薄色（うすいろ）","滅紫（けしむらさき）","江戸紫（えどむらさき）","京紫（きょうむらさき）","古代紫（こだいむらさき）","青紫（あおむらさき）","赤紫（あかむらさき）","紫紺（しこん）",
  "似紫（にせむらさき）","二藍（ふたあい）","藤色（ふじいろ）","藤紫（ふじむらさき）","楝色（おうちいろ）","紫苑色（しおんいろ）","菫色（すみれいろ）","竜胆色（りんどういろ）","桔梗色（ききょういろ）","杜若色（かたつばたいろ）",
  "菖蒲色（しょうぶいろ）","菖蒲色（あやめいろ）","葡萄染（えびぞめ）","鳩羽色（はとばいろ）","茄子紺（なすこん）",
  // 日本・茶
  "茶色（ちゃいろ）","焦茶（こげちゃ）","薄茶（うすちゃ）","土色（つちいろ）","黄土色（おうどいろ）","赭（そお）","代赭色（たいしゃいろ）","弁柄色（べんがらいろ）","丁字色（ちょうじいろ）","丁字茶（ちょうじちゃ）",
  "香色（こういろ）","赤香（あかこう）","焦香（こがれこう）","薄香（うすこう）","伽羅色（きゃらいろ）","黒茶（くろちゃ）","白茶（しらちゃ）","金茶（きんちゃ）","赤茶（あかちゃ）","黄茶（きちゃ）",
  "灰茶（はいちゃ）","団十郎茶（だんじゅうろうちゃ）","路孝茶（ろこうちゃ）","芝翫茶（しかんちゃ）","離寛茶（りかんちゃ）","梅幸茶（ばいこうちゃ）","利休茶（りきゅうちゃ）","仙斎茶（せんざいちゃ）","江戸茶（えどちゃ）","唐茶（からちゃ）",
  "媚茶（こびちゃ）","生壁色（なまかべいろ）","根岸色（ねぎしいろ）","柿渋色（かきしぶいろ）","渋紙色（しぶがみいろ）","黄櫨色（はじいろ）","黄櫨染（こうろぜん）","桑染（くわぞめ）","桑茶（くわちゃ）","樺色（かばいろ）",
  "紅樺色（べにかばいろ）","樺茶（かばちゃ）","枯色（かれいろ）","朽葉色（くちばいろ）","赤朽葉（あかくちば）","煤竹色（すすたけいろ）","檜皮色（ひわだいろ）","栗色（くりいろ）","栗梅（くりうめ）","胡桃色（くるみいろ）",
  "小豆色（あずきいろ）","飴色（あめいろ）","海老色（えびいろ）","海老茶（えびちゃ）","紅海老茶（べにえびちゃ）","小麦色（こむぎいろ）","褐色（かっしょく）","赤銅色（しゃくどういろ）","鳶色（とびいろ）","亜麻色（あまいろ）",
  "琥珀色（こはくいろ）","狐色（きつねいろ）","駱駝色（らくだいろ）","砥粉色（とのこいろ）","錆色（さびいろ）","赤錆色（あかさびいろ）","土器色（かわらけいろ）","煉瓦色（れんがいろ）","肉桂色（にっけいいろ）","煙草色（たばこいろ）",
  // 日本・白黒
  "生成色（きなりいろ）","練色（ねりいろ）","鳥の子色（とりのこいろ）","乳白色（にゅうはくしょく）","象牙色（ぞうげいろ）","胡粉色（ごふんいろ）","鉛白（えんぱく）","卯の花色（うのはないろ）","白（しろ）","黒（くろ）",
  "砂色（すないろ）","灰色（はいいろ）","灰汁色（あくいろ）","鉛色（なまりいろ）","鈍色（にびいろ）","青鈍（あおにび）","空五倍子色（うつぶしいろ）","山鳩色（やまばといろ）","鼠色（ねずみいろ）","茶鼠（ちゃねず）",
  "藍鼠（あいねず）","銀鼠（ぎんねず）","利休鼠（りきゅうねず）","深川鼠（ふかがわねず）","墨色（すみいろ）","薄墨色（うすずみいろ）","涅色（くりいろ）","漆黒（しっこく）","濡羽色（ぬればいろ）","鉄黒（てつぐろ）",
  "消炭色（けしずみいろ）","憲房色（けんぽういろ）",
  // 世界・赤
  "レッド","インディアンレッド","チャイニーズレッド","バーミリオン","ファイアーレッド","シグナルレッド","ルビーレッド","ガーネット","アガット","コーラルレッド","コーラルピンク","ピンク","シクラメンピンク","ブーゲンビリア","フクシアピンク",
  "フクシアパープル","マゼンタ","コチニールレッド","クリムソン","カーマイン","スカーレット","ローズマダー","ローズ","ローズレッド","ローズピンク","オールドローズ","ローズグレイ","ベゴニア","ピアニー","ポピーレッド",
  "チェリー","チェリーピンク","ストロベリー","ラズベリー","トマトレッド","ワインレッド","ボルドー","バーガンディー","ドーンピンク","シェルピンク","カージナルレッド","フラミンゴ","シェリンプピンク","サーモンピンク","ベビーピンク",
  "ネールピンク",
  // 世界・黄
  "ライムイエロー","オリーブ","オリーブドラブ","シャルトルーズイエロー","イエロー","ゴールデンイエロー","サルファーイエロー","クロムイエロー","クロムオレンジ","カドミウムイエロー","ネープルスイエロー","ジョンブリアン","カナリーイエロー","シャンパン","キャロットオレンジ",
  "パンプキン","メイズ","レモンイエロー","アプリコット","ピーチ","オレンジ","マンダリンオレンジ","ダンジェリンオレンジ","バーントオレンジ","ハニー","クリームイエロー","マスタード","サフランイエロー","ストローイエロー","バンブー",
  "マリーゴールド","サンフラワー","トパーズ","ブロンド","フレッシュ",
  // 世界・緑
  "グリーン","リーフグリーン","スプリンググリーン","グラスグリーン","フォレストグリーン","エバーグリーン","スプルース","ハンターグリーン","アイビーグリーン","セージグリーン","ウィローグリーン","エルムグリーン","ライムグリーン","モスグリーン","モスグレイ",
  "アップルグリーン","ピーグリーン","ピスタチオグリーン","オリーブグリーン","アイスグリーン","セラドン","マラカイトグリーン","ベルディグリ","コバルトグリーン","ビリジアン","クロムグリーン","シーグリーン","エメラルドグリーン","ジェードグリーン","ジャスパーグリーン",
  "オパールグリーン","ビリヤードグリーン","シャルトルーズグリーン","ミントグリーン","ボトルグリーン","パロットグリーン","ピーコックグリーン",
  // 世界・青
  "ブルー","スカイブルー","ホリゾンブルー","ゼニスブルー","アザーブルー","セレストブルー","ミッドナイトブルー","サルビアブルー","フォゲットミーノット","ヒヤシンス","アクアマリン","ラピスラズリ","ウルトラマリンブルー","サファイアブルー","ターコイズブルー",
  "インディゴ","ベビーブルー","スマルト","プルシャンブルー","アイアンブルー","コバルトブルー","セルリアンブルー","シアン","マリンブルー","ネイビーブルー","オリエンタルブルー","サックスブルー","ロイヤルブルー","ジェイブルー","ダックブルー",
  "ナイルブルー","ピーコックブルー",
  // 世界・紫
  "パープル","チリアンパープル","ロイヤルパープル","アメジスト","マルベリー","モーブ","バイオレッド","パンジー","ライラック","クロッカス","ウィスタリア","ラベンダー","ヘリオトロープ","オーキッド",
  // 世界・茶
  "ブラウン","ラセットブラウン","イエローオーカー","ローシェンナ","バーントシェンナ","ローアンバー","バーントアンバー","バンダイクブラウン","セピア","カーキー","ヘンナ","ベージュ","エクルベージュ","タン","バフ",
  "シャモア","フォーン","キャメル","マルーン","チェスナットブラウン","ヘーゼルブラウン","ココナッツブラウン","コルク","ブリックレッド","テラコッタ","マホガニー","コーヒーブラウン","ココアブラウン","チョコレート","シナモン",
  "キャラメル","ビスケット","ブロンズ","アンバー",
  // 世界・白黒
  "ホワイト","グレー","ブラック","スノーホワイト","オイスターホワイト","レグホーン","ミルキーホワイト","パールホワイト","パールグレー","パーチメント","アイボリー","サンド","スカイブルー","フォグブルー","アッシュグレー",
  "シルバーグレー","マウスグレー","トープ","ダブグレー","ガンメタルグレー","スレートグレー","チャコルグレー","スチールグレー","エボニー","アイボリーブラック","ランプブラック"
]